tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "black"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "cask"
brew "clang-format"
brew "cowsay"
brew "fortune"
brew "little-cms2"
brew "ghostscript"
brew "hydra"
brew "mas"
brew "neovim"
brew "nmap"
brew "node"
brew "pyright"
brew "rclone"
brew "ripgrep"
brew "tmux"
brew "tree"
cask "font-hack-nerd-font"
cask "nordvpn"
cask "notion"
mas "GarageBand", id: 682658836
mas "Goodnotes", id: 1444383602
mas "HP Smart", id: 1474276998
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Outlook", id: 985367838
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
